<a href="https://colab.research.google.com/github/jihyunjeongme/datascience-example-python/blob/master/1%EC%9E%A5_%ED%8C%90%EB%8B%A4%EC%8A%A4(Pandas)%EA%B3%A0%EA%B8%89%EA%B8%B0%EB%8A%A5_%EB%91%90_DataFrame_%EB%B3%91%ED%95%A9%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
# 연습용 데이터 3개를 만듬

df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B2','B3','B4'],
                    'C': ['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3']
                   }, index=[0,1,2,3])

df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                    'B': ['B4','B5','B6','B7'],
                    'C': ['C4','C5','C6','C7'],
                    'D': ['D4','D5','D6','D7']
                   }, index=[4,5,6,7])

df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                    'B': ['B8','B9','B10','B11'],
                    'C': ['C8','C9','C10','C11'],
                    'D': ['D8','D9','D10','D11']
                   }, index=[8,9,10,11])

In [4]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B2  C1  D1
2  A2  B3  C2  D2
3  A3  B4  C3  D3

In [5]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [6]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [0]:
# 이렇게 만든 데이터를 합치는 것은 concat 명령어